Tekla Open API Reference for Tekla Structures 2025
Picker.PickObject Method (Picker.PickObjectEnum, String)
 Queries the user to pick one model object from the model with the given prompt.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject PickObject(
	Picker.PickObjectEnum Enum,
	string Prompt
)
Public Function PickObject (
	Enum As Picker.PickObjectEnum,
	Prompt As String
) As ModelObject
Parameters
Enum
Type: Tekla.Structures.Model.UI.Picker.PickObjectEnum
Indicates the type of objects to pick.
Prompt
Type: System.String
The string to display as user guidance.
Return Value
Type: ModelObject
One model object instance.
See Also
Reference
Picker Class
PickObject Overload
Tekla.Structures.Model.UI Namespace